Revit 2027 API
IFCUserDefinedProperty Properties
The IFCUserDefinedProperty type exposes the following members.
Properties
Name | Description
DataType |  The data type of the property.
DataTypeDefined |  The defined value data type of the table property.
IFCPropertyName |  The IFC property name.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
PropertyType |  The type of the property.
RevitPropertyId |  The Revit property id.
RevitPropertyName |  The Revit property name.
Top
See Also
Reference
IFCUserDefinedProperty Class
Autodesk.Revit.DB Namespace